pulseaudio_dlna/plugins/upnp/xml/set_volume.xml

<?xml version="1.0" encoding="{encoding}" standalone="yes"?>
<s:Envelope s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Body>
        <u:SetVolume xmlns:u="{service_type}">
            <DesiredVolume>{volume}</DesiredVolume>
            <Channel>{channel}</Channel>
            <InstanceID>0</InstanceID>
        </u:SetVolume>
    </s:Body>
</s:Envelope>